src/InformationRegisters/ПроцентПоЗарплате/ПроцентПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроцентПоЗарплате</name>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПроцентПоЗарплате/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентПоЗарплате КАК ПроцентПоЗарплате
		|		ПО (Сотрудники.Ссылка = ПроцентПоЗарплате.Сотрудник)
		|ГДЕ
		|	ПроцентПоЗарплате.Сотрудник ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Для Каждого Элемент Из ВыборкаДетальныеЗаписи Цикл
			Сотрудник= РегистрыСведений.ПроцентПоЗарплате.СоздатьМенеджерЗаписи();
			Сотрудник.Сотрудник=Справочники.Сотрудники.НайтиПоНаименованию(Элемент);
			Сотрудник.Процент = Константы.СтандартныйПроцент.Получить();
			Сотрудник.Период=Формат(ТекущаяДата());
			Сотрудник.Записать();
	КонецЦикла;

КонецПроцедуры
